#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/infrastructure/infrastructure/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/infrastructure/infrastructure

To view this run in a browser, visit:
https://app.terraform.io/app/jon77p-xyz/infrastructure/runs/run-4p55w4zdhUdQkckc

Waiting for the plan to start...

Terraform v1.1.8
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.oci1.module.tunnel.cloudflare_record.ssh_app["kube1"]: Refreshing state... [id=d6f298504cc56f5d01399e3eca67f6e2]
module.oci0.module.tunnel.cloudflare_access_application.ssh_app["kube0"]: Refreshing state... [id=00e86331-c301-4286-b7ba-1f3c916e9a21]
module.oci0.module.tunnel.cloudflare_access_application.ssh_app["firefly"]: Refreshing state... [id=19eee7f0-635a-4b81-ba53-606849be257a]
module.oci2.module.tunnel.cloudflare_access_application.ssh_app["healthchecks"]: Refreshing state... [id=cce63fc4-49d3-4e40-b284-77d5661157a3]
module.oci2.module.tunnel.cloudflare_access_application.ssh_app["kube2"]: Refreshing state... [id=510a4cb9-543b-4dda-864e-61df173ee296]
module.oci2.module.tunnel.cloudflare_access_application.ssh_app["vault"]: Refreshing state... [id=26858ce9-c320-4f6d-9c5c-3a79d4931dc8]
module.oci1.module.tunnel.cloudflare_record.ssh_app["nextcloud"]: Refreshing state... [id=ebf1f43f21fba83e609416d8b729d00d]
module.oci1.module.tunnel.cloudflare_record.ssh_app["unused2"]: Refreshing state... [id=67e3f8e2cd8795e7756e8a10bd294c73]
module.oci1.module.tunnel.cloudflare_access_application.ssh_app["kube1"]: Refreshing state... [id=ecc2195f-6a40-4360-82a8-d58cc520140d]
module.oci1.module.tunnel.cloudflare_access_application.ssh_app["nextcloud"]: Refreshing state... [id=daac3060-473f-406e-be8f-5708c94c32d7]
module.oci1.module.tunnel.cloudflare_access_application.ssh_app["unused2"]: Refreshing state... [id=247d1d34-a000-41ad-a772-ce964e534ae3]
module.oci0.module.tunnel.cloudflare_record.ssh_app["firefly"]: Refreshing state... [id=2c62c18c51aeb569dfcd0777b9279697]
module.oci0.module.tunnel.cloudflare_record.ssh_app["kube0"]: Refreshing state... [id=e6c302ce3536bf253f465335e62ceed3]
module.oci2.module.tunnel.cloudflare_record.ssh_app["healthchecks"]: Refreshing state... [id=d66d2530b27c6cafe5fc6fa8b9d6150b]
module.oci2.module.tunnel.cloudflare_record.ssh_app["kube2"]: Refreshing state... [id=dddb947d4c5c8c5393e2b081159c60b9]
module.oci2.module.tunnel.cloudflare_record.ssh_app["vault"]: Refreshing state... [id=883970b99f2508ba9111835237204591]
module.oci2.module.tunnel.random_id.tunnel_secret: Refreshing state... [id=TZnGSUwL2fly2VLc9ZRCoCpuglRM3I123ml1PUFY0qcr3Iw]
module.oci0.module.tunnel.random_id.tunnel_secret: Refreshing state... [id=t5Ylw-gyjx04CHIIurYGtrfHKzC7d6Rr0ewPKIP2lFKGtjo]
module.oci1.module.tunnel.random_id.tunnel_secret: Refreshing state... [id=Ptqpxdf18pMdJjY1noNdL9n-OXzksQJEb49ECURcpzE3OLU]
module.oci2.module.base.oci_identity_compartment.terraform: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaae3xi4uohtc42rxuxf6gekarmnkmww62yhftzhyh5k7qncv77x2eq]
module.oci0.module.base.oci_identity_compartment.terraform: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaaifb5znbuiwdij3lnc7vunthpdjxpn52f6dwzdwd7vgivsk65q6vq]
module.oci1.module.base.oci_identity_compartment.terraform: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaabmomhkttvm2ai3kos3oyntnktoxgy7n47xekua6k2aeycrumdpda]
module.oci2.module.tunnel.cloudflare_access_policy.ssh_policy["vault"]: Refreshing state... [id=44be8483-3800-4172-95a3-60d8d2394a2c]
module.oci2.module.tunnel.cloudflare_access_policy.ssh_policy["healthchecks"]: Refreshing state... [id=1cf01bde-7006-4051-9d5d-1e4728083387]
module.oci2.module.tunnel.cloudflare_access_policy.ssh_policy["kube2"]: Refreshing state... [id=849c5f21-408c-4781-b337-f6430109baac]
module.oci0.module.tunnel.cloudflare_access_policy.ssh_policy["firefly"]: Refreshing state... [id=0bad85b9-3d66-49d3-b99a-8cb5b01bb3ec]
module.oci0.module.tunnel.cloudflare_access_policy.ssh_policy["kube0"]: Refreshing state... [id=7dfb3959-e935-4c4e-aacf-c7532504087b]
module.oci2.module.tunnel.cloudflare_argo_tunnel.tunnel["healthchecks"]: Refreshing state... [id=508649b6-3c11-4da3-8f61-004bc0322462]
module.oci2.module.tunnel.cloudflare_argo_tunnel.tunnel["kube2"]: Refreshing state... [id=db8a1cc8-141b-491d-b244-a659ce9228d7]
module.oci2.module.tunnel.cloudflare_argo_tunnel.tunnel["vault"]: Refreshing state... [id=9ef27159-e6fb-4666-ac5b-08fd2269662d]
module.oci0.module.tunnel.cloudflare_argo_tunnel.tunnel["firefly"]: Refreshing state... [id=5e6a56d3-00f8-438f-ae6c-ed47bb6b187d]
module.oci0.module.tunnel.cloudflare_argo_tunnel.tunnel["kube0"]: Refreshing state... [id=54fd732d-9494-434e-abfa-13eaa57027e5]
module.oci1.module.tunnel.cloudflare_argo_tunnel.tunnel["nextcloud"]: Refreshing state... [id=a6a56c12-49b0-4b19-8529-6c6ff1f2b961]
module.oci1.module.tunnel.cloudflare_argo_tunnel.tunnel["unused2"]: Refreshing state... [id=9bb22aa7-f402-490a-8634-050c4780fe7f]
module.oci1.module.tunnel.cloudflare_argo_tunnel.tunnel["kube1"]: Refreshing state... [id=05178404-b845-4b79-8eb2-61677f984956]
module.oci2.module.base.module.vcn.oci_core_vcn.vcn: Refreshing state... [id=ocid1.vcn.oc1.us-sanjose-1.amaaaaaavaxvekyaoj4fzlj7p3yjcrs4w43d4a4wrl66r7imu72wnuxlu2ta]
module.oci0.module.base.module.vcn.oci_core_vcn.vcn: Refreshing state... [id=ocid1.vcn.oc1.us-sanjose-1.amaaaaaakausufias76fypqp5jqnbc2wtwnw5t2x3llxv43yawzuosvgx4va]
module.oci1.module.base.module.vcn.oci_core_vcn.vcn: Refreshing state... [id=ocid1.vcn.oc1.us-sanjose-1.amaaaaaaral6dnyaecwbnakj2oxdzmrfio4yicm6wtbirh3ie72el6u2ifxa]
module.oci2.module.base.module.vcn.oci_core_default_security_list.lockdown[0]: Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaalyhzgg62xjphp45djwm74thcy4zrsodnjtpypwrpnoinaddydlhq]
module.oci2.module.base.module.vcn.oci_core_internet_gateway.ig[0]: Refreshing state... [id=ocid1.internetgateway.oc1.us-sanjose-1.aaaaaaaajw3fvihif27v5qlh57hu6ii6lpwec6j5ngslxbhupbj23jkd7bbq]
module.oci0.module.base.module.vcn.oci_core_internet_gateway.ig[0]: Refreshing state... [id=ocid1.internetgateway.oc1.us-sanjose-1.aaaaaaaanns6ekzdx4cijpz6cwsg2gth26xpwiqtxwgbfxnkh6d3dk6v3cuq]
module.oci0.module.base.module.vcn.oci_core_default_security_list.lockdown[0]: Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaanhck334hf3z4pn7a7uhzaf3rb36lndwdiregd6ea2zipldrgbcfa]
module.oci1.module.base.module.vcn.oci_core_default_security_list.lockdown[0]: Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaavpplshhdylvghhmzxnpdxkkct36e6333fao72dmtmni3hwy64ypq]
module.oci1.module.base.module.vcn.oci_core_internet_gateway.ig[0]: Refreshing state... [id=ocid1.internetgateway.oc1.us-sanjose-1.aaaaaaaao3tirlcgsoz7ylwvi3kf53phk4jqrr5a4runfpggs7huxw56xhya]
module.oci2.module.base.oci_core_security_list.terraform: Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaahhfytlv54ydzqrcrvwg4vcyyj23wyers7sc5hnqaxc7bl4qsxczq]
module.oci1.module.base.oci_core_security_list.terraform: Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaarrq26dupgce2vjclpzmwifmnfwruahjnqzhvnf7vjzvht2yxb3yq]
module.oci0.module.base.oci_core_security_list.terraform: Refreshing state... [id=ocid1.securitylist.oc1.us-sanjose-1.aaaaaaaacglzv7utkjdvipy3xz7surmtgopdnf57yw4qcwgjyo4nl33ls2tq]
module.oci2.module.tunnel.cloudflare_record.tunnel_app["healthchecks"]: Refreshing state... [id=c91b32d4e3f7ccb348a2302fa494cfb4]
module.oci2.module.tunnel.cloudflare_record.tunnel_app["kube2"]: Refreshing state... [id=c4c54c4b0977405a2e8bd2d15c591794]
module.oci2.module.tunnel.cloudflare_record.tunnel_app["vault"]: Refreshing state... [id=6280ffd0eab668b68f246aad0f8f6c45]
module.oci0.module.base.module.vcn.oci_core_route_table.ig[0]: Refreshing state... [id=ocid1.routetable.oc1.us-sanjose-1.aaaaaaaaahdscb76dpqjo5isakmx7r3k5ivsku3fseyy3jwvzihmz57g2k2q]
module.oci2.module.base.module.vcn.oci_core_route_table.ig[0]: Refreshing state... [id=ocid1.routetable.oc1.us-sanjose-1.aaaaaaaabfzwqjczajpdq2s4uscfqynt2tuslkar7xbzt5tydxpno425m7ra]
module.oci1.module.base.module.vcn.oci_core_route_table.ig[0]: Refreshing state... [id=ocid1.routetable.oc1.us-sanjose-1.aaaaaaaalygnzkbk5byiu5kilaec6n75kivikaxewbtkcdrgtu5ld3om6zsq]
module.oci2.module.base.oci_core_subnet.public: Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaavhp2apg7jr7pr2biy2hebxanl6fq52s4czhuxfz4tzggf2h46afa]
module.oci2.module.base.oci_core_subnet.private: Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaangzoux7mhijtinvd3qrxkfmk7huxzmhxtn5ws6r2eiihrov63ugq]
module.oci1.module.base.oci_core_subnet.public: Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaal32rkhxrlldcenntlhcgcnyeqpcozjedo7tssaarscykcwgpvv6q]
module.oci1.module.base.oci_core_subnet.private: Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaax2qrlpe4uxkbfaxk2pjzbsgfskrh56qy3tk56nicnuq3iuizxcha]
module.oci0.module.tunnel.cloudflare_record.tunnel_app["firefly"]: Refreshing state... [id=d6c2e108ace87ca41928c7eb38fd763d]
module.oci0.module.tunnel.cloudflare_record.tunnel_app["kube0"]: Refreshing state... [id=a6f2f29cd7e6708fc46443088c3d144c]
module.oci0.module.base.oci_core_subnet.public: Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaamjnxwxgva5vm2etrxpaoa2qsx6h3rncl7hqnlh2qlh6c6vd4choa]
module.oci0.module.base.oci_core_subnet.private: Refreshing state... [id=ocid1.subnet.oc1.us-sanjose-1.aaaaaaaanxbozc5whwzlizxtpdmz32zjr2dry7fk53cq6ysolaglnotvchaa]
module.oci1.module.tunnel.cloudflare_access_policy.ssh_policy["nextcloud"]: Refreshing state... [id=6cbc29fd-2104-40cc-bbc5-6f76081d77a1]
module.oci1.module.tunnel.cloudflare_access_policy.ssh_policy["kube1"]: Refreshing state... [id=88e85969-3c12-40f5-8361-5872280bd769]
module.oci1.module.tunnel.cloudflare_access_policy.ssh_policy["unused2"]: Refreshing state... [id=5540ea72-5ebb-4621-bdcf-fc481e5c219d]
module.oci2.module.compute.oci_core_instance.ubuntu_instance["kube2"]: Refreshing state... [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekyccqgqfpgrhenoy6nace6hiqjkpsvwisaac7dnbkqc6ojq]
module.oci2.module.compute.oci_core_instance.ubuntu_instance["vault"]: Refreshing state... [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekycnhnl3zsxlcwvklerd7lnugyt4cwtenb2eenhojy7mtnq]
module.oci2.module.compute.oci_core_instance.ubuntu_instance["healthchecks"]: Refreshing state... [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekycy25karetcdmki6iiphkapoixdqcfnvl4rc6shlqlay4a]
module.oci1.module.tunnel.cloudflare_record.tunnel_app["kube1"]: Refreshing state... [id=9a900628fe75449aca5fded5b29aeafb]
module.oci1.module.tunnel.cloudflare_record.tunnel_app["nextcloud"]: Refreshing state... [id=84151cf092af1f7bc4029dba2404ee5a]
module.oci1.module.tunnel.cloudflare_record.tunnel_app["unused2"]: Refreshing state... [id=73a7398f6f75be6b81c5ab07c3e09cf2]
module.oci1.module.compute.oci_core_instance.ubuntu_instance["kube1"]: Refreshing state... [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnycvcjfyyggfu7lp567uq7luv75i6lgwxm74jhxwsaufuaa]
module.oci1.module.compute.oci_core_instance.ubuntu_instance["nextcloud"]: Refreshing state... [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnycgroddtc6zxmzjih67ty67vrmuse5tibspuq7cv46ubda]
module.oci1.module.compute.oci_core_instance.ubuntu_instance["unused2"]: Refreshing state... [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnycfhwns7xh6zfqxfmsq5lclpkid2fca3ljhueg72ql2vzq]
module.oci0.module.compute.oci_core_instance.ubuntu_instance["firefly"]: Refreshing state... [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrkausuficrau7mekzhrxf6wjhxt4zufxs5flbmwvr3g65panurlua]
module.oci0.module.compute.oci_core_instance.ubuntu_instance["kube0"]: Refreshing state... [id=ocid1.instance.oc1.us-sanjose-1.anzwuljrkausuficgiw5cjgcgamlaaobkbxnchuogmdp47qvwowr4aonfvsq]
module.oci2.cloudflare_record.instance_record["kube2"]: Refreshing state... [id=45224b62342c204bb47b8143c314eda0]
module.oci2.cloudflare_record.instance_record["vault"]: Refreshing state... [id=8205bf5d4f42e520ac2bb79357b5040f]
module.oci2.cloudflare_record.instance_record["healthchecks"]: Refreshing state... [id=2cc1590eebc475c8d9e5857e89604da0]
module.oci1.cloudflare_record.instance_record["kube1"]: Refreshing state... [id=b2a9d1bda1c3bb2159c1599d64bfe8e2]
module.oci1.cloudflare_record.instance_record["nextcloud"]: Refreshing state... [id=688a7c37ec232b91a344604f50272efc]
module.oci1.cloudflare_record.instance_record["unused2"]: Refreshing state... [id=b79549e7119afb89dd0e7271047e8baa]
module.oci0.cloudflare_record.instance_record["kube0"]: Refreshing state... [id=543c8ac10492239b90b620f58955edcc]
module.oci0.cloudflare_record.instance_record["firefly"]: Refreshing state... [id=e470e18af5dde40fd54bbdd3b5d8e220]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.oci0.cloudflare_record.instance_record["firefly"] will be updated in-place
  ~ resource "cloudflare_record" "instance_record" {
        id              = "e470e18af5dde40fd54bbdd3b5d8e220"
        name            = "firefly.oci0.jon77p.xyz"
      ~ value           = "155.248.192.181" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.oci0.cloudflare_record.instance_record["kube0"] will be updated in-place
  ~ resource "cloudflare_record" "instance_record" {
        id              = "543c8ac10492239b90b620f58955edcc"
        name            = "kube0.oci0.jon77p.xyz"
      ~ value           = "152.70.118.99" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.oci1.cloudflare_record.instance_record["kube1"] will be updated in-place
  ~ resource "cloudflare_record" "instance_record" {
        id              = "b2a9d1bda1c3bb2159c1599d64bfe8e2"
        name            = "kube1.oci1.jon77p.xyz"
      ~ value           = "150.230.38.200" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.oci1.cloudflare_record.instance_record["nextcloud"] will be updated in-place
  ~ resource "cloudflare_record" "instance_record" {
        id              = "688a7c37ec232b91a344604f50272efc"
        name            = "nextcloud.oci1.jon77p.xyz"
      ~ value           = "155.248.193.215" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.oci1.cloudflare_record.instance_record["unused2"] will be updated in-place
  ~ resource "cloudflare_record" "instance_record" {
        id              = "b79549e7119afb89dd0e7271047e8baa"
        name            = "unused2.oci1.jon77p.xyz"
      ~ value           = "155.248.193.220" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.oci2.cloudflare_record.instance_record["healthchecks"] will be updated in-place
  ~ resource "cloudflare_record" "instance_record" {
        id              = "2cc1590eebc475c8d9e5857e89604da0"
        name            = "healthchecks.oci2.jon77p.xyz"
      ~ value           = "150.230.37.196" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.oci2.cloudflare_record.instance_record["kube2"] will be updated in-place
  ~ resource "cloudflare_record" "instance_record" {
        id              = "45224b62342c204bb47b8143c314eda0"
        name            = "kube2.oci2.jon77p.xyz"
      ~ value           = "155.248.208.169" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.oci2.cloudflare_record.instance_record["vault"] will be updated in-place
  ~ resource "cloudflare_record" "instance_record" {
        id              = "8205bf5d4f42e520ac2bb79357b5040f"
        name            = "vault.oci2.jon77p.xyz"
      ~ value           = "192.9.251.187" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.oci0.module.compute.oci_core_instance.ubuntu_instance["firefly"] must be replaced
-/+ resource "oci_core_instance" "ubuntu_instance" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrteuntkzqeylhu4pijgwy5oga4b7adrcopkk2qbv7gpxietuh7isq" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon77p@gmail.com"
          - "Oracle-Tags.CreatedOn" = "2022-03-24T03:16:31.681Z"
        } -> (known after apply)
      - extended_metadata                   = {} -> null
      ~ fault_domain                        = "FAULT-DOMAIN-1" -> (known after apply)
      ~ freeform_tags                       = {} -> (known after apply)
      ~ hostname_label                      = "firefly" -> (known after apply)
      ~ id                                  = "ocid1.instance.oc1.us-sanjose-1.anzwuljrkausuficrau7mekzhrxf6wjhxt4zufxs5flbmwvr3g65panurlua" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.us-sanjose-1.aaaaaaaadq3dxjoqeckwgas733dxmrfsdconukiq357m6sjhb2xyhfpi4ica" -> (known after apply)
      + ipxe_script                         = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = {
          - "ssh_authorized_keys" = (sensitive)
          - "user_data"           = (sensitive)
        } -> (known after apply) # forces replacement
      ~ private_ip                          = "10.0.0.220" -> (known after apply)
      ~ public_ip                           = "155.248.192.181" -> (known after apply)
      ~ region                              = "us-sanjose-1" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaamjnxwxgva5vm2etrxpaoa2qsx6h3rncl7hqnlh2qlh6c6vd4choa" -> (known after apply)
      ~ system_tags                         = {
          - "orcl-cloud.free-tier-retained" = "true"
        } -> (known after apply)
      ~ time_created                        = "2022-03-24 03:16:32.263 +0000 UTC" -> (known after apply)
      ~ time_maintenance_reboot_due         = "" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ agent_config {
          ~ are_all_plugins_disabled = false -> (known after apply)
          ~ is_management_disabled   = false -> (known after apply)
          ~ is_monitoring_disabled   = false -> (known after apply)

          + plugins_config {
              + desired_state = (known after apply)
              + name          = (known after apply)
            }
        }

      ~ availability_config {
          ~ is_live_migration_preferred = false -> (known after apply)
          ~ recovery_action             = "RESTORE_INSTANCE" -> (known after apply)
        }

      ~ create_vnic_details {
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon77p@gmail.com"
              - "Oracle-Tags.CreatedOn" = "2022-03-24T03:16:31.860Z"
            } -> (known after apply)
          ~ display_name              = "firefly" -> (known after apply)
          ~ freeform_tags             = {} -> (known after apply)
          - nsg_ids                   = [] -> null
          ~ private_ip                = "10.0.0.220" -> (known after apply)
          ~ skip_source_dest_check    = false -> (known after apply)
          + vlan_id                   = (known after apply)
            # (4 unchanged attributes hidden)
        }

      ~ instance_options {
          ~ are_legacy_imds_endpoints_disabled = false -> (known after apply)
        }

      ~ launch_options {
          ~ boot_volume_type                    = "PARAVIRTUALIZED" -> (known after apply)
          ~ firmware                            = "UEFI_64" -> (known after apply)
          ~ is_consistent_volume_naming_enabled = true -> (known after apply)
          ~ is_pv_encryption_in_transit_enabled = false -> (known after apply)
          ~ network_type                        = "PARAVIRTUALIZED" -> (known after apply)
          ~ remote_data_volume_type             = "PARAVIRTUALIZED" -> (known after apply)
        }

      + platform_config {
          + is_measured_boot_enabled           = (known after apply)
          + is_secure_boot_enabled             = (known after apply)
          + is_trusted_platform_module_enabled = (known after apply)
          + numa_nodes_per_socket              = (known after apply)
          + type                               = (known after apply)
        }

      + preemptible_instance_config {
          + preemption_action {
              + preserve_boot_volume = (known after apply)
              + type                 = (known after apply)
            }
        }

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 1 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 0.47999998927116394 -> (known after apply)
          ~ processor_description         = "2.0 GHz AMD EPYC™ 7551 (Naples)" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + kms_key_id              = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.oci0.module.compute.oci_core_instance.ubuntu_instance["kube0"] must be replaced
-/+ resource "oci_core_instance" "ubuntu_instance" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrjvqjtklxuzohgph3ygi5csl7umiw3vv6tizrqyi5uazddx5fjt2a" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon77p@gmail.com"
          - "Oracle-Tags.CreatedOn" = "2022-01-18T01:50:35.143Z"
        } -> (known after apply)
      - extended_metadata                   = {} -> null
      ~ fault_domain                        = "FAULT-DOMAIN-2" -> (known after apply)
      ~ freeform_tags                       = {} -> (known after apply)
      ~ hostname_label                      = "kube0" -> (known after apply)
      ~ id                                  = "ocid1.instance.oc1.us-sanjose-1.anzwuljrkausuficgiw5cjgcgamlaaobkbxnchuogmdp47qvwowr4aonfvsq" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.us-sanjose-1.aaaaaaaacdzh2e4tcrxowru2ygh62eiqp4iu2q2io3ippaqdtxks2ojtw5uq" -> (known after apply)
      + ipxe_script                         = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = {
          - "ssh_authorized_keys" = (sensitive)
          - "user_data"           = (sensitive)
        } -> (known after apply) # forces replacement
      ~ private_ip                          = "10.0.0.154" -> (known after apply)
      ~ public_ip                           = "152.70.118.99" -> (known after apply)
      ~ region                              = "us-sanjose-1" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaamjnxwxgva5vm2etrxpaoa2qsx6h3rncl7hqnlh2qlh6c6vd4choa" -> (known after apply)
      ~ system_tags                         = {} -> (known after apply)
      ~ time_created                        = "2022-01-18 01:50:35.543 +0000 UTC" -> (known after apply)
      ~ time_maintenance_reboot_due         = "" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ agent_config {
          ~ are_all_plugins_disabled = false -> (known after apply)
          ~ is_management_disabled   = false -> (known after apply)
          ~ is_monitoring_disabled   = false -> (known after apply)

          + plugins_config {
              + desired_state = (known after apply)
              + name          = (known after apply)
            }
        }

      ~ availability_config {
          ~ is_live_migration_preferred = false -> (known after apply)
          ~ recovery_action             = "RESTORE_INSTANCE" -> (known after apply)
        }

      ~ create_vnic_details {
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon77p@gmail.com"
              - "Oracle-Tags.CreatedOn" = "2022-01-18T01:50:35.275Z"
            } -> (known after apply)
          ~ display_name              = "kube0" -> (known after apply)
          ~ freeform_tags             = {} -> (known after apply)
          - nsg_ids                   = [] -> null
          ~ private_ip                = "10.0.0.154" -> (known after apply)
          ~ skip_source_dest_check    = false -> (known after apply)
          + vlan_id                   = (known after apply)
            # (4 unchanged attributes hidden)
        }

      ~ instance_options {
          ~ are_legacy_imds_endpoints_disabled = false -> (known after apply)
        }

      ~ launch_options {
          ~ boot_volume_type                    = "PARAVIRTUALIZED" -> (known after apply)
          ~ firmware                            = "UEFI_64" -> (known after apply)
          ~ is_consistent_volume_naming_enabled = true -> (known after apply)
          ~ is_pv_encryption_in_transit_enabled = false -> (known after apply)
          ~ network_type                        = "PARAVIRTUALIZED" -> (known after apply)
          ~ remote_data_volume_type             = "PARAVIRTUALIZED" -> (known after apply)
        }

      + platform_config {
          + is_measured_boot_enabled           = (known after apply)
          + is_secure_boot_enabled             = (known after apply)
          + is_trusted_platform_module_enabled = (known after apply)
          + numa_nodes_per_socket              = (known after apply)
          + type                               = (known after apply)
        }

      + preemptible_instance_config {
          + preemption_action {
              + preserve_boot_volume = (known after apply)
              + type                 = (known after apply)
            }
        }

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 4 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 4 -> (known after apply)
          ~ processor_description         = "3.0 GHz Ampere® Altra™" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + kms_key_id              = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.oci0.module.tunnel.cloudflare_access_application.ssh_app["firefly"] will be updated in-place
  ~ resource "cloudflare_access_application" "ssh_app" {
      ~ app_launcher_visible       = true -> false
        id                         = "19eee7f0-635a-4b81-ba53-606849be257a"
        name                       = "ssh-firefly.jon77p.xyz"
        # (11 unchanged attributes hidden)
    }

  # module.oci0.module.tunnel.cloudflare_access_application.ssh_app["kube0"] will be updated in-place
  ~ resource "cloudflare_access_application" "ssh_app" {
      ~ app_launcher_visible       = true -> false
        id                         = "00e86331-c301-4286-b7ba-1f3c916e9a21"
        name                       = "ssh-kube0.jon77p.xyz"
        # (11 unchanged attributes hidden)
    }

  # module.oci0.module.tunnel.cloudflare_access_ca_certificate.ssh_certificate["firefly"] will be created
  + resource "cloudflare_access_ca_certificate" "ssh_certificate" {
      + account_id     = (known after apply)
      + application_id = "19eee7f0-635a-4b81-ba53-606849be257a"
      + aud            = (known after apply)
      + id             = (known after apply)
      + public_key     = (known after apply)
      + zone_id        = "37bb8a24a516ee0d0a679d3018f95e50"
    }

  # module.oci0.module.tunnel.cloudflare_access_ca_certificate.ssh_certificate["kube0"] will be created
  + resource "cloudflare_access_ca_certificate" "ssh_certificate" {
      + account_id     = (known after apply)
      + application_id = "00e86331-c301-4286-b7ba-1f3c916e9a21"
      + aud            = (known after apply)
      + id             = (known after apply)
      + public_key     = (known after apply)
      + zone_id        = "37bb8a24a516ee0d0a679d3018f95e50"
    }

  # module.oci1.module.compute.oci_core_instance.ubuntu_instance["kube1"] must be replaced
-/+ resource "oci_core_instance" "ubuntu_instance" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrs2c3cmepqi6mynuytgh6hbetkrd7hbq2zhnlowlpu7hp7ootrnka" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon77.p@gmail.com"
          - "Oracle-Tags.CreatedOn" = "2022-01-18T01:50:44.501Z"
        } -> (known after apply)
      - extended_metadata                   = {} -> null
      ~ fault_domain                        = "FAULT-DOMAIN-3" -> (known after apply)
      ~ freeform_tags                       = {} -> (known after apply)
      ~ hostname_label                      = "kube1" -> (known after apply)
      ~ id                                  = "ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnycvcjfyyggfu7lp567uq7luv75i6lgwxm74jhxwsaufuaa" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.us-sanjose-1.aaaaaaaacdzh2e4tcrxowru2ygh62eiqp4iu2q2io3ippaqdtxks2ojtw5uq" -> (known after apply)
      + ipxe_script                         = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = {
          - "ssh_authorized_keys" = (sensitive)
          - "user_data"           = (sensitive)
        } -> (known after apply) # forces replacement
      ~ private_ip                          = "10.0.0.143" -> (known after apply)
      ~ public_ip                           = "150.230.38.200" -> (known after apply)
      ~ region                              = "us-sanjose-1" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaal32rkhxrlldcenntlhcgcnyeqpcozjedo7tssaarscykcwgpvv6q" -> (known after apply)
      ~ system_tags                         = {} -> (known after apply)
      ~ time_created                        = "2022-01-18 01:50:44.889 +0000 UTC" -> (known after apply)
      ~ time_maintenance_reboot_due         = "" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ agent_config {
          ~ are_all_plugins_disabled = false -> (known after apply)
          ~ is_management_disabled   = false -> (known after apply)
          ~ is_monitoring_disabled   = false -> (known after apply)

          + plugins_config {
              + desired_state = (known after apply)
              + name          = (known after apply)
            }
        }

      ~ availability_config {
          ~ is_live_migration_preferred = false -> (known after apply)
          ~ recovery_action             = "RESTORE_INSTANCE" -> (known after apply)
        }

      ~ create_vnic_details {
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon77.p@gmail.com"
              - "Oracle-Tags.CreatedOn" = "2022-01-18T01:50:44.621Z"
            } -> (known after apply)
          ~ display_name              = "kube1" -> (known after apply)
          ~ freeform_tags             = {} -> (known after apply)
          - nsg_ids                   = [] -> null
          ~ private_ip                = "10.0.0.143" -> (known after apply)
          ~ skip_source_dest_check    = false -> (known after apply)
          + vlan_id                   = (known after apply)
            # (4 unchanged attributes hidden)
        }

      ~ instance_options {
          ~ are_legacy_imds_endpoints_disabled = false -> (known after apply)
        }

      ~ launch_options {
          ~ boot_volume_type                    = "PARAVIRTUALIZED" -> (known after apply)
          ~ firmware                            = "UEFI_64" -> (known after apply)
          ~ is_consistent_volume_naming_enabled = true -> (known after apply)
          ~ is_pv_encryption_in_transit_enabled = false -> (known after apply)
          ~ network_type                        = "PARAVIRTUALIZED" -> (known after apply)
          ~ remote_data_volume_type             = "PARAVIRTUALIZED" -> (known after apply)
        }

      + platform_config {
          + is_measured_boot_enabled           = (known after apply)
          + is_secure_boot_enabled             = (known after apply)
          + is_trusted_platform_module_enabled = (known after apply)
          + numa_nodes_per_socket              = (known after apply)
          + type                               = (known after apply)
        }

      + preemptible_instance_config {
          + preemption_action {
              + preserve_boot_volume = (known after apply)
              + type                 = (known after apply)
            }
        }

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 4 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 4 -> (known after apply)
          ~ processor_description         = "3.0 GHz Ampere® Altra™" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + kms_key_id              = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.oci1.module.compute.oci_core_instance.ubuntu_instance["nextcloud"] must be replaced
-/+ resource "oci_core_instance" "ubuntu_instance" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrl2bmk2hvpx6i23z2p43ob3yntipurngt6sawoan4xivwz4vvzhdq" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon77.p@gmail.com"
          - "Oracle-Tags.CreatedOn" = "2022-01-18T01:50:24.335Z"
        } -> (known after apply)
      - extended_metadata                   = {} -> null
      ~ fault_domain                        = "FAULT-DOMAIN-1" -> (known after apply)
      ~ freeform_tags                       = {} -> (known after apply)
      ~ hostname_label                      = "nextcloud" -> (known after apply)
      ~ id                                  = "ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnycgroddtc6zxmzjih67ty67vrmuse5tibspuq7cv46ubda" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.us-sanjose-1.aaaaaaaadq3dxjoqeckwgas733dxmrfsdconukiq357m6sjhb2xyhfpi4ica" -> (known after apply)
      + ipxe_script                         = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = {
          - "ssh_authorized_keys" = (sensitive)
          - "user_data"           = (sensitive)
        } -> (known after apply) # forces replacement
      ~ private_ip                          = "10.0.0.23" -> (known after apply)
      ~ public_ip                           = "155.248.193.215" -> (known after apply)
      ~ region                              = "us-sanjose-1" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaal32rkhxrlldcenntlhcgcnyeqpcozjedo7tssaarscykcwgpvv6q" -> (known after apply)
      ~ system_tags                         = {
          - "orcl-cloud.free-tier-retained" = "true"
        } -> (known after apply)
      ~ time_created                        = "2022-01-18 01:50:24.708 +0000 UTC" -> (known after apply)
      ~ time_maintenance_reboot_due         = "" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ agent_config {
          ~ are_all_plugins_disabled = false -> (known after apply)
          ~ is_management_disabled   = false -> (known after apply)
          ~ is_monitoring_disabled   = false -> (known after apply)

          + plugins_config {
              + desired_state = (known after apply)
              + name          = (known after apply)
            }
        }

      ~ availability_config {
          ~ is_live_migration_preferred = false -> (known after apply)
          ~ recovery_action             = "RESTORE_INSTANCE" -> (known after apply)
        }

      ~ create_vnic_details {
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon77.p@gmail.com"
              - "Oracle-Tags.CreatedOn" = "2022-01-18T01:50:24.518Z"
            } -> (known after apply)
          ~ display_name              = "nextcloud" -> (known after apply)
          ~ freeform_tags             = {} -> (known after apply)
          - nsg_ids                   = [] -> null
          ~ private_ip                = "10.0.0.23" -> (known after apply)
          ~ skip_source_dest_check    = false -> (known after apply)
          + vlan_id                   = (known after apply)
            # (4 unchanged attributes hidden)
        }

      ~ instance_options {
          ~ are_legacy_imds_endpoints_disabled = false -> (known after apply)
        }

      ~ launch_options {
          ~ boot_volume_type                    = "PARAVIRTUALIZED" -> (known after apply)
          ~ firmware                            = "UEFI_64" -> (known after apply)
          ~ is_consistent_volume_naming_enabled = true -> (known after apply)
          ~ is_pv_encryption_in_transit_enabled = false -> (known after apply)
          ~ network_type                        = "PARAVIRTUALIZED" -> (known after apply)
          ~ remote_data_volume_type             = "PARAVIRTUALIZED" -> (known after apply)
        }

      + platform_config {
          + is_measured_boot_enabled           = (known after apply)
          + is_secure_boot_enabled             = (known after apply)
          + is_trusted_platform_module_enabled = (known after apply)
          + numa_nodes_per_socket              = (known after apply)
          + type                               = (known after apply)
        }

      + preemptible_instance_config {
          + preemption_action {
              + preserve_boot_volume = (known after apply)
              + type                 = (known after apply)
            }
        }

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 1 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 0.47999998927116394 -> (known after apply)
          ~ processor_description         = "2.0 GHz AMD EPYC™ 7551 (Naples)" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + kms_key_id              = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.oci1.module.compute.oci_core_instance.ubuntu_instance["unused2"] must be replaced
-/+ resource "oci_core_instance" "ubuntu_instance" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrhs2yruxrjk5zm6lcbwhto2hgmyptgmam3tcqqbao45pcx46pbgwq" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon77.p@gmail.com"
          - "Oracle-Tags.CreatedOn" = "2022-03-14T19:11:02.815Z"
        } -> (known after apply)
      - extended_metadata                   = {} -> null
      ~ fault_domain                        = "FAULT-DOMAIN-2" -> (known after apply)
      ~ freeform_tags                       = {} -> (known after apply)
      ~ hostname_label                      = "unused2" -> (known after apply)
      ~ id                                  = "ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnycfhwns7xh6zfqxfmsq5lclpkid2fca3ljhueg72ql2vzq" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.us-sanjose-1.aaaaaaaadq3dxjoqeckwgas733dxmrfsdconukiq357m6sjhb2xyhfpi4ica" -> (known after apply)
      + ipxe_script                         = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = {
          - "ssh_authorized_keys" = (sensitive)
          - "user_data"           = (sensitive)
        } -> (known after apply) # forces replacement
      ~ private_ip                          = "10.0.0.253" -> (known after apply)
      ~ public_ip                           = "155.248.193.220" -> (known after apply)
      ~ region                              = "us-sanjose-1" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaal32rkhxrlldcenntlhcgcnyeqpcozjedo7tssaarscykcwgpvv6q" -> (known after apply)
      ~ system_tags                         = {
          - "orcl-cloud.free-tier-retained" = "true"
        } -> (known after apply)
      ~ time_created                        = "2022-03-14 19:11:03.395 +0000 UTC" -> (known after apply)
      ~ time_maintenance_reboot_due         = "" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ agent_config {
          ~ are_all_plugins_disabled = false -> (known after apply)
          ~ is_management_disabled   = false -> (known after apply)
          ~ is_monitoring_disabled   = false -> (known after apply)

          + plugins_config {
              + desired_state = (known after apply)
              + name          = (known after apply)
            }
        }

      ~ availability_config {
          ~ is_live_migration_preferred = false -> (known after apply)
          ~ recovery_action             = "RESTORE_INSTANCE" -> (known after apply)
        }

      ~ create_vnic_details {
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon77.p@gmail.com"
              - "Oracle-Tags.CreatedOn" = "2022-03-14T19:11:02.992Z"
            } -> (known after apply)
          ~ display_name              = "unused2" -> (known after apply)
          ~ freeform_tags             = {} -> (known after apply)
          - nsg_ids                   = [] -> null
          ~ private_ip                = "10.0.0.253" -> (known after apply)
          ~ skip_source_dest_check    = false -> (known after apply)
          + vlan_id                   = (known after apply)
            # (4 unchanged attributes hidden)
        }

      ~ instance_options {
          ~ are_legacy_imds_endpoints_disabled = false -> (known after apply)
        }

      ~ launch_options {
          ~ boot_volume_type                    = "PARAVIRTUALIZED" -> (known after apply)
          ~ firmware                            = "UEFI_64" -> (known after apply)
          ~ is_consistent_volume_naming_enabled = true -> (known after apply)
          ~ is_pv_encryption_in_transit_enabled = false -> (known after apply)
          ~ network_type                        = "PARAVIRTUALIZED" -> (known after apply)
          ~ remote_data_volume_type             = "PARAVIRTUALIZED" -> (known after apply)
        }

      + platform_config {
          + is_measured_boot_enabled           = (known after apply)
          + is_secure_boot_enabled             = (known after apply)
          + is_trusted_platform_module_enabled = (known after apply)
          + numa_nodes_per_socket              = (known after apply)
          + type                               = (known after apply)
        }

      + preemptible_instance_config {
          + preemption_action {
              + preserve_boot_volume = (known after apply)
              + type                 = (known after apply)
            }
        }

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 1 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 0.47999998927116394 -> (known after apply)
          ~ processor_description         = "2.0 GHz AMD EPYC™ 7551 (Naples)" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + kms_key_id              = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.oci1.module.tunnel.cloudflare_access_application.ssh_app["kube1"] will be updated in-place
  ~ resource "cloudflare_access_application" "ssh_app" {
      ~ app_launcher_visible       = true -> false
        id                         = "ecc2195f-6a40-4360-82a8-d58cc520140d"
        name                       = "ssh-kube1.jon77p.xyz"
        # (11 unchanged attributes hidden)
    }

  # module.oci1.module.tunnel.cloudflare_access_application.ssh_app["nextcloud"] will be updated in-place
  ~ resource "cloudflare_access_application" "ssh_app" {
      ~ app_launcher_visible       = true -> false
        id                         = "daac3060-473f-406e-be8f-5708c94c32d7"
        name                       = "ssh-nextcloud.jon77p.xyz"
        # (11 unchanged attributes hidden)
    }

  # module.oci1.module.tunnel.cloudflare_access_application.ssh_app["unused2"] will be updated in-place
  ~ resource "cloudflare_access_application" "ssh_app" {
      ~ app_launcher_visible       = true -> false
        id                         = "247d1d34-a000-41ad-a772-ce964e534ae3"
        name                       = "ssh-unused2.jon77p.xyz"
        # (11 unchanged attributes hidden)
    }

  # module.oci1.module.tunnel.cloudflare_access_ca_certificate.ssh_certificate["kube1"] will be created
  + resource "cloudflare_access_ca_certificate" "ssh_certificate" {
      + account_id     = (known after apply)
      + application_id = "ecc2195f-6a40-4360-82a8-d58cc520140d"
      + aud            = (known after apply)
      + id             = (known after apply)
      + public_key     = (known after apply)
      + zone_id        = "37bb8a24a516ee0d0a679d3018f95e50"
    }

  # module.oci1.module.tunnel.cloudflare_access_ca_certificate.ssh_certificate["nextcloud"] will be created
  + resource "cloudflare_access_ca_certificate" "ssh_certificate" {
      + account_id     = (known after apply)
      + application_id = "daac3060-473f-406e-be8f-5708c94c32d7"
      + aud            = (known after apply)
      + id             = (known after apply)
      + public_key     = (known after apply)
      + zone_id        = "37bb8a24a516ee0d0a679d3018f95e50"
    }

  # module.oci1.module.tunnel.cloudflare_access_ca_certificate.ssh_certificate["unused2"] will be created
  + resource "cloudflare_access_ca_certificate" "ssh_certificate" {
      + account_id     = (known after apply)
      + application_id = "247d1d34-a000-41ad-a772-ce964e534ae3"
      + aud            = (known after apply)
      + id             = (known after apply)
      + public_key     = (known after apply)
      + zone_id        = "37bb8a24a516ee0d0a679d3018f95e50"
    }

  # module.oci2.module.compute.oci_core_instance.ubuntu_instance["healthchecks"] must be replaced
-/+ resource "oci_core_instance" "ubuntu_instance" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrqqcljfvksiim5akjxmmvedbfdagcnkrmlf47z57i63ckkpbb7uqq" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
          - "Oracle-Tags.CreatedOn" = "2022-01-18T01:50:44.122Z"
        } -> (known after apply)
      - extended_metadata                   = {} -> null
      ~ fault_domain                        = "FAULT-DOMAIN-3" -> (known after apply)
      ~ freeform_tags                       = {} -> (known after apply)
      ~ hostname_label                      = "healthchecks" -> (known after apply)
      ~ id                                  = "ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekycy25karetcdmki6iiphkapoixdqcfnvl4rc6shlqlay4a" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.us-sanjose-1.aaaaaaaadq3dxjoqeckwgas733dxmrfsdconukiq357m6sjhb2xyhfpi4ica" -> (known after apply)
      + ipxe_script                         = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = {
          - "ssh_authorized_keys" = (sensitive)
          - "user_data"           = (sensitive)
        } -> (known after apply) # forces replacement
      ~ private_ip                          = "10.0.0.130" -> (known after apply)
      ~ public_ip                           = "150.230.37.196" -> (known after apply)
      ~ region                              = "us-sanjose-1" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaavhp2apg7jr7pr2biy2hebxanl6fq52s4czhuxfz4tzggf2h46afa" -> (known after apply)
      ~ system_tags                         = {
          - "orcl-cloud.free-tier-retained" = "true"
        } -> (known after apply)
      ~ time_created                        = "2022-01-18 01:50:44.405 +0000 UTC" -> (known after apply)
      ~ time_maintenance_reboot_due         = "" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ agent_config {
          ~ are_all_plugins_disabled = false -> (known after apply)
          ~ is_management_disabled   = false -> (known after apply)
          ~ is_monitoring_disabled   = false -> (known after apply)

          + plugins_config {
              + desired_state = (known after apply)
              + name          = (known after apply)
            }
        }

      ~ availability_config {
          ~ is_live_migration_preferred = false -> (known after apply)
          ~ recovery_action             = "RESTORE_INSTANCE" -> (known after apply)
        }

      ~ create_vnic_details {
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
              - "Oracle-Tags.CreatedOn" = "2022-01-18T01:50:34.576Z"
            } -> (known after apply)
          ~ display_name              = "healthchecks" -> (known after apply)
          ~ freeform_tags             = {} -> (known after apply)
          - nsg_ids                   = [] -> null
          ~ private_ip                = "10.0.0.130" -> (known after apply)
          ~ skip_source_dest_check    = false -> (known after apply)
          + vlan_id                   = (known after apply)
            # (4 unchanged attributes hidden)
        }

      ~ instance_options {
          ~ are_legacy_imds_endpoints_disabled = false -> (known after apply)
        }

      ~ launch_options {
          ~ boot_volume_type                    = "PARAVIRTUALIZED" -> (known after apply)
          ~ firmware                            = "UEFI_64" -> (known after apply)
          ~ is_consistent_volume_naming_enabled = true -> (known after apply)
          ~ is_pv_encryption_in_transit_enabled = false -> (known after apply)
          ~ network_type                        = "PARAVIRTUALIZED" -> (known after apply)
          ~ remote_data_volume_type             = "PARAVIRTUALIZED" -> (known after apply)
        }

      + platform_config {
          + is_measured_boot_enabled           = (known after apply)
          + is_secure_boot_enabled             = (known after apply)
          + is_trusted_platform_module_enabled = (known after apply)
          + numa_nodes_per_socket              = (known after apply)
          + type                               = (known after apply)
        }

      + preemptible_instance_config {
          + preemption_action {
              + preserve_boot_volume = (known after apply)
              + type                 = (known after apply)
            }
        }

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 1 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 0.47999998927116394 -> (known after apply)
          ~ processor_description         = "2.0 GHz AMD EPYC™ 7551 (Naples)" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + kms_key_id              = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.oci2.module.compute.oci_core_instance.ubuntu_instance["kube2"] must be replaced
-/+ resource "oci_core_instance" "ubuntu_instance" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrs7dwds3rrhbpyjbwpbudhd7zsr44jqnb6skyn2llqlpwxrkvghwa" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
          - "Oracle-Tags.CreatedOn" = "2022-01-18T01:50:44.278Z"
        } -> (known after apply)
      - extended_metadata                   = {} -> null
      ~ fault_domain                        = "FAULT-DOMAIN-3" -> (known after apply)
      ~ freeform_tags                       = {} -> (known after apply)
      ~ hostname_label                      = "kube2" -> (known after apply)
      ~ id                                  = "ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekyccqgqfpgrhenoy6nace6hiqjkpsvwisaac7dnbkqc6ojq" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.us-sanjose-1.aaaaaaaacdzh2e4tcrxowru2ygh62eiqp4iu2q2io3ippaqdtxks2ojtw5uq" -> (known after apply)
      + ipxe_script                         = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = {
          - "ssh_authorized_keys" = (sensitive)
          - "user_data"           = (sensitive)
        } -> (known after apply) # forces replacement
      ~ private_ip                          = "10.0.0.4" -> (known after apply)
      ~ public_ip                           = "155.248.208.169" -> (known after apply)
      ~ region                              = "us-sanjose-1" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaavhp2apg7jr7pr2biy2hebxanl6fq52s4czhuxfz4tzggf2h46afa" -> (known after apply)
      ~ system_tags                         = {} -> (known after apply)
      ~ time_created                        = "2022-01-18 01:50:44.723 +0000 UTC" -> (known after apply)
      ~ time_maintenance_reboot_due         = "" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ agent_config {
          ~ are_all_plugins_disabled = false -> (known after apply)
          ~ is_management_disabled   = false -> (known after apply)
          ~ is_monitoring_disabled   = false -> (known after apply)

          + plugins_config {
              + desired_state = (known after apply)
              + name          = (known after apply)
            }
        }

      ~ availability_config {
          ~ is_live_migration_preferred = false -> (known after apply)
          ~ recovery_action             = "RESTORE_INSTANCE" -> (known after apply)
        }

      ~ create_vnic_details {
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
              - "Oracle-Tags.CreatedOn" = "2022-01-18T01:50:44.439Z"
            } -> (known after apply)
          ~ display_name              = "kube2" -> (known after apply)
          ~ freeform_tags             = {} -> (known after apply)
          - nsg_ids                   = [] -> null
          ~ private_ip                = "10.0.0.4" -> (known after apply)
          ~ skip_source_dest_check    = false -> (known after apply)
          + vlan_id                   = (known after apply)
            # (4 unchanged attributes hidden)
        }

      ~ instance_options {
          ~ are_legacy_imds_endpoints_disabled = false -> (known after apply)
        }

      ~ launch_options {
          ~ boot_volume_type                    = "PARAVIRTUALIZED" -> (known after apply)
          ~ firmware                            = "UEFI_64" -> (known after apply)
          ~ is_consistent_volume_naming_enabled = true -> (known after apply)
          ~ is_pv_encryption_in_transit_enabled = false -> (known after apply)
          ~ network_type                        = "PARAVIRTUALIZED" -> (known after apply)
          ~ remote_data_volume_type             = "PARAVIRTUALIZED" -> (known after apply)
        }

      + platform_config {
          + is_measured_boot_enabled           = (known after apply)
          + is_secure_boot_enabled             = (known after apply)
          + is_trusted_platform_module_enabled = (known after apply)
          + numa_nodes_per_socket              = (known after apply)
          + type                               = (known after apply)
        }

      + preemptible_instance_config {
          + preemption_action {
              + preserve_boot_volume = (known after apply)
              + type                 = (known after apply)
            }
        }

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 4 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 4 -> (known after apply)
          ~ processor_description         = "3.0 GHz Ampere® Altra™" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + kms_key_id              = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.oci2.module.compute.oci_core_instance.ubuntu_instance["vault"] must be replaced
-/+ resource "oci_core_instance" "ubuntu_instance" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrvyvel2gqdk3hknsvulzbsvxq7wagdbpzxnzjitytgasyn4ss7i5q" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
          - "Oracle-Tags.CreatedOn" = "2022-01-18T01:50:34.444Z"
        } -> (known after apply)
      - extended_metadata                   = {} -> null
      ~ fault_domain                        = "FAULT-DOMAIN-3" -> (known after apply)
      ~ freeform_tags                       = {} -> (known after apply)
      ~ hostname_label                      = "vault" -> (known after apply)
      ~ id                                  = "ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekycnhnl3zsxlcwvklerd7lnugyt4cwtenb2eenhojy7mtnq" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.us-sanjose-1.aaaaaaaadq3dxjoqeckwgas733dxmrfsdconukiq357m6sjhb2xyhfpi4ica" -> (known after apply)
      + ipxe_script                         = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = {
          - "ssh_authorized_keys" = (sensitive)
          - "user_data"           = (sensitive)
        } -> (known after apply) # forces replacement
      ~ private_ip                          = "10.0.0.36" -> (known after apply)
      ~ public_ip                           = "192.9.251.187" -> (known after apply)
      ~ region                              = "us-sanjose-1" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.us-sanjose-1.aaaaaaaavhp2apg7jr7pr2biy2hebxanl6fq52s4czhuxfz4tzggf2h46afa" -> (known after apply)
      ~ system_tags                         = {
          - "orcl-cloud.free-tier-retained" = "true"
        } -> (known after apply)
      ~ time_created                        = "2022-01-18 01:50:35.006 +0000 UTC" -> (known after apply)
      ~ time_maintenance_reboot_due         = "" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ agent_config {
          ~ are_all_plugins_disabled = false -> (known after apply)
          ~ is_management_disabled   = false -> (known after apply)
          ~ is_monitoring_disabled   = false -> (known after apply)

          + plugins_config {
              + desired_state = (known after apply)
              + name          = (known after apply)
            }
        }

      ~ availability_config {
          ~ is_live_migration_preferred = false -> (known after apply)
          ~ recovery_action             = "RESTORE_INSTANCE" -> (known after apply)
        }

      ~ create_vnic_details {
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/jon7.7.p@gmail.com"
              - "Oracle-Tags.CreatedOn" = "2022-01-18T01:50:34.576Z"
            } -> (known after apply)
          ~ display_name              = "vault" -> (known after apply)
          ~ freeform_tags             = {} -> (known after apply)
          - nsg_ids                   = [] -> null
          ~ private_ip                = "10.0.0.36" -> (known after apply)
          ~ skip_source_dest_check    = false -> (known after apply)
          + vlan_id                   = (known after apply)
            # (4 unchanged attributes hidden)
        }

      ~ instance_options {
          ~ are_legacy_imds_endpoints_disabled = false -> (known after apply)
        }

      ~ launch_options {
          ~ boot_volume_type                    = "PARAVIRTUALIZED" -> (known after apply)
          ~ firmware                            = "UEFI_64" -> (known after apply)
          ~ is_consistent_volume_naming_enabled = true -> (known after apply)
          ~ is_pv_encryption_in_transit_enabled = false -> (known after apply)
          ~ network_type                        = "PARAVIRTUALIZED" -> (known after apply)
          ~ remote_data_volume_type             = "PARAVIRTUALIZED" -> (known after apply)
        }

      + platform_config {
          + is_measured_boot_enabled           = (known after apply)
          + is_secure_boot_enabled             = (known after apply)
          + is_trusted_platform_module_enabled = (known after apply)
          + numa_nodes_per_socket              = (known after apply)
          + type                               = (known after apply)
        }

      + preemptible_instance_config {
          + preemption_action {
              + preserve_boot_volume = (known after apply)
              + type                 = (known after apply)
            }
        }

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 1 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 0.47999998927116394 -> (known after apply)
          ~ processor_description         = "2.0 GHz AMD EPYC™ 7551 (Naples)" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + kms_key_id              = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.oci2.module.tunnel.cloudflare_access_application.ssh_app["healthchecks"] will be updated in-place
  ~ resource "cloudflare_access_application" "ssh_app" {
      ~ app_launcher_visible       = true -> false
        id                         = "cce63fc4-49d3-4e40-b284-77d5661157a3"
        name                       = "ssh-healthchecks.jon77p.xyz"
        # (11 unchanged attributes hidden)
    }

  # module.oci2.module.tunnel.cloudflare_access_application.ssh_app["kube2"] will be updated in-place
  ~ resource "cloudflare_access_application" "ssh_app" {
      ~ app_launcher_visible       = true -> false
        id                         = "510a4cb9-543b-4dda-864e-61df173ee296"
        name                       = "ssh-kube2.jon77p.xyz"
        # (11 unchanged attributes hidden)
    }

  # module.oci2.module.tunnel.cloudflare_access_application.ssh_app["vault"] will be updated in-place
  ~ resource "cloudflare_access_application" "ssh_app" {
      ~ app_launcher_visible       = true -> false
        id                         = "26858ce9-c320-4f6d-9c5c-3a79d4931dc8"
        name                       = "ssh-vault.jon77p.xyz"
        # (11 unchanged attributes hidden)
    }

  # module.oci2.module.tunnel.cloudflare_access_ca_certificate.ssh_certificate["healthchecks"] will be created
  + resource "cloudflare_access_ca_certificate" "ssh_certificate" {
      + account_id     = (known after apply)
      + application_id = "cce63fc4-49d3-4e40-b284-77d5661157a3"
      + aud            = (known after apply)
      + id             = (known after apply)
      + public_key     = (known after apply)
      + zone_id        = "37bb8a24a516ee0d0a679d3018f95e50"
    }

  # module.oci2.module.tunnel.cloudflare_access_ca_certificate.ssh_certificate["kube2"] will be created
  + resource "cloudflare_access_ca_certificate" "ssh_certificate" {
      + account_id     = (known after apply)
      + application_id = "510a4cb9-543b-4dda-864e-61df173ee296"
      + aud            = (known after apply)
      + id             = (known after apply)
      + public_key     = (known after apply)
      + zone_id        = "37bb8a24a516ee0d0a679d3018f95e50"
    }

  # module.oci2.module.tunnel.cloudflare_access_ca_certificate.ssh_certificate["vault"] will be created
  + resource "cloudflare_access_ca_certificate" "ssh_certificate" {
      + account_id     = (known after apply)
      + application_id = "26858ce9-c320-4f6d-9c5c-3a79d4931dc8"
      + aud            = (known after apply)
      + id             = (known after apply)
      + public_key     = (known after apply)
      + zone_id        = "37bb8a24a516ee0d0a679d3018f95e50"
    }

Plan: 16 to add, 16 to change, 8 to destroy.

Changes to Outputs:
  ~ oci0-instance-OCID        = {
      ~ firefly = "ocid1.instance.oc1.us-sanjose-1.anzwuljrkausuficrau7mekzhrxf6wjhxt4zufxs5flbmwvr3g65panurlua" -> (known after apply)
      ~ kube0   = "ocid1.instance.oc1.us-sanjose-1.anzwuljrkausuficgiw5cjgcgamlaaobkbxnchuogmdp47qvwowr4aonfvsq" -> (known after apply)
    }
  ~ oci0-instance-boot-volume = [
      - "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrteuntkzqeylhu4pijgwy5oga4b7adrcopkk2qbv7gpxietuh7isq",
      - "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrjvqjtklxuzohgph3ygi5csl7umiw3vv6tizrqyi5uazddx5fjt2a",
      + (known after apply),
      + (known after apply),
    ]
  ~ oci0-instance-public-ip   = {
      ~ firefly = "155.248.192.181" -> (known after apply)
      ~ kube0   = "152.70.118.99" -> (known after apply)
    }
  ~ oci1-instance-OCID        = {
      ~ kube1     = "ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnycvcjfyyggfu7lp567uq7luv75i6lgwxm74jhxwsaufuaa" -> (known after apply)
      ~ nextcloud = "ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnycgroddtc6zxmzjih67ty67vrmuse5tibspuq7cv46ubda" -> (known after apply)
      ~ unused2   = "ocid1.instance.oc1.us-sanjose-1.anzwuljrral6dnycfhwns7xh6zfqxfmsq5lclpkid2fca3ljhueg72ql2vzq" -> (known after apply)
    }
  ~ oci1-instance-boot-volume = [
      - "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrs2c3cmepqi6mynuytgh6hbetkrd7hbq2zhnlowlpu7hp7ootrnka",
      - "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrl2bmk2hvpx6i23z2p43ob3yntipurngt6sawoan4xivwz4vvzhdq",
      - "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrhs2yruxrjk5zm6lcbwhto2hgmyptgmam3tcqqbao45pcx46pbgwq",
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ oci1-instance-public-ip   = {
      ~ kube1     = "150.230.38.200" -> (known after apply)
      ~ nextcloud = "155.248.193.215" -> (known after apply)
      ~ unused2   = "155.248.193.220" -> (known after apply)
    }
  ~ oci2-instance-OCID        = {
      ~ healthchecks = "ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekycy25karetcdmki6iiphkapoixdqcfnvl4rc6shlqlay4a" -> (known after apply)
      ~ kube2        = "ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekyccqgqfpgrhenoy6nace6hiqjkpsvwisaac7dnbkqc6ojq" -> (known after apply)
      ~ vault        = "ocid1.instance.oc1.us-sanjose-1.anzwuljrvaxvekycnhnl3zsxlcwvklerd7lnugyt4cwtenb2eenhojy7mtnq" -> (known after apply)
    }
  ~ oci2-instance-boot-volume = [
      - "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrqqcljfvksiim5akjxmmvedbfdagcnkrmlf47z57i63ckkpbb7uqq",
      - "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrs7dwds3rrhbpyjbwpbudhd7zsr44jqnb6skyn2llqlpwxrkvghwa",
      - "ocid1.bootvolume.oc1.us-sanjose-1.abzwuljrvyvel2gqdk3hknsvulzbsvxq7wagdbpzxnzjitytgasyn4ss7i5q",
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ oci2-instance-public-ip   = {
      ~ healthchecks = "150.230.37.196" -> (known after apply)
      ~ kube2        = "155.248.208.169" -> (known after apply)
      ~ vault        = "192.9.251.187" -> (known after apply)
    }

```

</details>

*Pusher: @jon77p, Action: `pull_request`*